Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 64, 64, 1)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 32, 32, 32)        288       
_________________________________________________________________
batch_normalization (BatchNo (None, 32, 32, 32)        128       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 16, 16, 64)        18432     
_________________________________________________________________
batch_normalization_1 (Batch (None, 16, 16, 64)        256       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 8, 8, 128)         73728     
_________________________________________________________________
batch_normalization_2 (Batch (None, 8, 8, 128)         512       
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 4, 4, 256)         294912    
_________________________________________________________________
batch_normalization_3 (Batch (None, 4, 4, 256)         1024      
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 2, 2, 256)         589824    
_________________________________________________________________
batch_normalization_4 (Batch (None, 2, 2, 256)         1024      
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 1, 1, 256)         589824    
_________________________________________________________________
batch_normalization_5 (Batch (None, 1, 1, 256)         1024      
_________________________________________________________________
conv2d_transpose (Conv2DTran (None, 2, 2, 256)         589824    
_________________________________________________________________
batch_normalization_6 (Batch (None, 2, 2, 256)         1024      
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 4, 4, 256)         589824    
_________________________________________________________________
batch_normalization_7 (Batch (None, 4, 4, 256)         1024      
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 8, 8, 256)         589824    
_________________________________________________________________
batch_normalization_8 (Batch (None, 8, 8, 256)         1024      
_________________________________________________________________
conv2d_transpose_3 (Conv2DTr (None, 16, 16, 128)       294912    
_________________________________________________________________
batch_normalization_9 (Batch (None, 16, 16, 128)       512       
_________________________________________________________________
conv2d_transpose_4 (Conv2DTr (None, 32, 32, 64)        73728     
_________________________________________________________________
batch_normalization_10 (Batc (None, 32, 32, 64)        256       
_________________________________________________________________
conv2d_transpose_5 (Conv2DTr (None, 64, 64, 32)        18432     
_________________________________________________________________
batch_normalization_11 (Batc (None, 64, 64, 32)        128       
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 64, 64, 1)         289       
=================================================================
Total params: 3,731,777
Trainable params: 3,727,809
Non-trainable params: 3,968
_________________________________________________________________
